## Data frame concept in pandas

In [22]:
import pandas as pd
import numpy as np

In [5]:
data={'state':['up','mp','bihar','delhi','panjab'],'year':[2000,2001,2002,2003,2004],'budget':[1.1,1.2,1.3,1.4,1.4]}

In [6]:
frame=pd.DataFrame(data) # create data frame

In [7]:
frame

   budget   state  year
0     1.1      up  2000
1     1.2      mp  2001
2     1.3   bihar  2002
3     1.4   delhi  2003
4     1.4  panjab  2004

In [8]:
frame.head # it is used to select first five column

<bound method NDFrame.head of    budget   state  year
0     1.1      up  2000
1     1.2      mp  2001
2     1.3   bihar  2002
3     1.4   delhi  2003
4     1.4  panjab  2004>

In [10]:
pd.DataFrame(data,columns=['state','year','budget'])

    state  year  budget
0      up  2000     1.1
1      mp  2001     1.2
2   bihar  2002     1.3
3   delhi  2003     1.4
4  panjab  2004     1.4

In [11]:
frame2=pd.DataFrame(data,columns=['state','year','budget','grow'],index=['a','b','c','d','e'])

In [12]:
frame2

    state  year  budget grow
a      up  2000     1.1  NaN
b      mp  2001     1.2  NaN
c   bihar  2002     1.3  NaN
d   delhi  2003     1.4  NaN
e  panjab  2004     1.4  NaN

In [13]:
frame2.columns

Index(['state', 'year', 'budget', 'grow'], dtype='object')

In [16]:
frame2['state'] # it is used to select any column data

a        up
b        mp
c     bihar
d     delhi
e    panjab
Name: state, dtype: object

In [17]:
frame2.state

a        up
b        mp
c     bihar
d     delhi
e    panjab
Name: state, dtype: object

In [19]:
frame2.loc['e'] # to select any row

state     panjab
year        2004
budget       1.4
grow         NaN
Name: e, dtype: object

In [20]:
frame2['grow']=8.8 #to assign value to a column

In [21]:
frame2

    state  year  budget  grow
a      up  2000     1.1   8.8
b      mp  2001     1.2   8.8
c   bihar  2002     1.3   8.8
d   delhi  2003     1.4   8.8
e  panjab  2004     1.4   8.8

In [25]:
frame2['grow']=np.arange(5) # fill data into column with the help of array

In [24]:
frame2

    state  year  budget  grow
a      up  2000     1.1     0
b      mp  2001     1.2     1
c   bihar  2002     1.3     2
d   delhi  2003     1.4     3
e  panjab  2004     1.4     4

In [26]:
data1=pd.Series([8.7,5.5,6.6],index=['a','c','e'])

In [29]:
frame2['grow']=data1 # used to assinged data to individual rows

In [30]:
frame2

    state  year  budget  grow
a      up  2000     1.1   8.7
b      mp  2001     1.2   NaN
c   bihar  2002     1.3   5.5
d   delhi  2003     1.4   NaN
e  panjab  2004     1.4   6.6

In [32]:
frame2['eastern']=frame2.state=='mp'

In [33]:
frame2

    state  year  budget  grow  eastern
a      up  2000     1.1   8.7    False
b      mp  2001     1.2   NaN     True
c   bihar  2002     1.3   5.5    False
d   delhi  2003     1.4   NaN    False
e  panjab  2004     1.4   6.6    False

In [34]:
del frame2['eastern']

In [35]:
frame2

    state  year  budget  grow
a      up  2000     1.1   8.7
b      mp  2001     1.2   NaN
c   bihar  2002     1.3   5.5
d   delhi  2003     1.4   NaN
e  panjab  2004     1.4   6.6

In [36]:
frame2.index.name='srnumber';frame2.columns.name='attributes'

In [37]:
frame2

attributes   state  year  budget  grow
srnumber
a               up  2000     1.1   8.7
b               mp  2001     1.2   NaN
c            bihar  2002     1.3   5.5
d            delhi  2003     1.4   NaN
e           panjab  2004     1.4   6.6